import React from "react"

function TermOfService() {
  return (
    <main className="p-10">
      <h2 className="font-bold text-3xl text-center mb-3">服务条款</h2>
      <div className="p-3 rounded-xl border border-[#ccc]">
        <div>
          若您申请工程数字化管理平台（以下简称“平台”）并使用相应服务，您必须首先同意此协议。
        </div>
        <h3 className="font-bold text-xl">一、接受</h3>
        <p className="text-lg leading-8">
          (1) 当您使用服务时，表示您已知晓并且同意此《服务条款》；
          <br />
          (2)此协议在必要时将进行修改更新，网站发布后立即生效；属于政策性调整的，在30天内将通过电子邮件的方式通知帐户；
          <br />
          (3)如果您拒绝接受新的协议，将被视为放弃使用平台提供的服务；若您继续使用平台提供的服务，则表明您已接受新的协议；
          <br />
          (4) 除非特别声明，某些增强服务的新功能将适用此协议； <br />
          (5) 此协议只有平台书面授权人员才可以修改。
        </p>
        <h3 className="font-bold text-xl">二、使用本协议</h3>
        <p>
          (1)此协议所述服务仅在平台及对应的APP内有效。平台是指 https://zctc.cc及其对应的APP;
          <br />
          (2)以下行为是我们坚决反对和禁止的:
          <br />
          a.以恶意目的对平台进行任何形式的反向工程、反向编译、反汇编，或在竞争产品抄袭模仿本网站的设计；
          b.对网站服务器进行恶意攻击，或者采取恶意手段使用平台，造成服务器异常；
          c.使用筑宬软件从事非法活动或者为非法活动提供帮助； d.法律法规规定的其他情形。
          如果您有上述行为，我们将视该行为引起的后果的严重性追究责任，并保留通过法律途径追偿合理损失的权利。
          (4)平台有权根据实际情况自主调整服务内容。
        </p>
        <h3>三、帐户</h3>
        <p>
          (1) 平台的帐户应是能够承担相应法律责任的企业和个人;
          (2)平台要求帐户在使用服务时必须遵守相关法律法规。对帐户使用服务所产生的与其他公司或者个人的纠纷不负法律责任;
          (3)平台有权对恶意帐户中止服务，并无需特别通知;
          (4)对于体验账号，用户如注册后在平台规定的天数内未完成转正式账号的手续，也未通知平台延长体验时间，平台有权利清除帐号及其相关数据。您需自行承担数据被销毁后所引发的一切后果。
        </p>
        <h3>四、隐私保护 </h3>
        <p>平台为用户提供了完备的隐私保护机制，具体请参阅《隐私声明》中的相关约定。</p>
        <h3>五、服务期限</h3>
        <p>
          平台有权判定帐户的行为是否符合本《服务协议》的要求，如果帐户违背了该《服务协议》的规定，平台有权决定停止该帐户的使用资格或者采取其他平台认为合适的措施。
        </p>
        <h3>六、服务终止</h3>
        <p>有下列情形之一的，平台有权随时暂停、终止、取消或拒绝帐户服务</p>
        <ol>
          <li>(1)帐户违反了此协议或已在约定范围内的任一条款;</li>
          <li>(2) 根据此协议相关说明而终止服务;</li>
          <li>(3) 未经请求或授权向平台帐户发送大量与业务不相关的信息;</li>
          <li>(4) 冒用其他企业的名义发布商业信息，进行商业活动;</li>
          <li>(5) 攻击平台的数据、网络或服务;</li>
          <li>(6) 盗用他人在平台的帐户名或密码。</li>
        </ol>
        <p>以下信息是严格禁止并绝对终止帐户服务的:</p>
        <ol>
          <li>(1) 有关宗教、种族或性别的贬损言辞; </li>
          <li>
            (2) 侵犯任何第三方著作权、专利、商标、商业秘密或其它专有权利、发表权或隐私权的信息;
          </li>
          <li>(3) 其它任何违反互联网相关法律法规的信息。</li>
        </ol>
        <h3>七、账号安全声明</h3>
        <p>
          <ol>
            <li>
              (1)平台采取了安全策略。如果账户触发了平台的安全机制。将被暂时或永久禁止再次访问凭条。同时，其他帐户在平台上发布的信息将暂时或永久不能被该帐户查看;
            </li>
            <li>
              <div>(2) 登录名，密码和安全</div>
              <div>
                在注册过程中，您可自主选择一个登录名和密码，并须对其保密性负责，同时对使用该登录名和密码的所有活动负责。您同意
              </div>
              <ol>
                <li>
                  ①对非授权使用您的登录名及密码以及其他破坏安全性的行为，帐户应立即向平台告知，平台将采取技术措施阻止恶意破坏;
                </li>
                <li>
                  ②确保每次使用平台后正确地离开该站点。平台对您因没有遵守此协议而造成的损失不负任何法律责任。
                </li>
                <li>③因您保管不善可能导致遭受盗号或密码失窃，责任由您自行承担。</li>
              </ol>
            </li>
            <li>
              (3)对于使用第三方账户(微信)登陆的用户，第三方账号安全与否与平台无关，对于因第三方账号出现的安全事故，平台不承担任何法律责任。
            </li>
          </ol>
        </p>
        <h3></h3>
        八、帐户的权利和义务 (1)平台帐户服务生效后，帐户就可享受相应服务内容;
        (2)在使用平台提供的相应服务时必须保证遵守当地及中国有关法律法规的规定;不得利用该网站进行任何非法活动;遵守所有与使用该网站有关的协议、规定、程序和惯例;
        (3)如需修改自己的帐户信息资料，必须接受平台的审核与批准。如果使用虚假的帐户信息资料，我们有权终止其服务;
        (4) 帐户对输入数据的准确性、可靠性、合法性、适用性等负责;
        (5)对由于帐户在使用平台服务的过程中，违反本协议或通过提及而纳入本协议的条款和规则或帐户违反任何法律或第三方的权利而产生或引起的每一种类似性质的任何索赔、要求、诉讼、损失和损害(实际、特别及后果性的》而言，无论是已知或未知的，包括合理的律师费，帐户同意就此对平台权利人、员工、所有者进行补偿并使其免受损害。
        九、平台的权利和义务 (1)为用户提供平台承诺的服务;
        (2)平台服务的所有权和经营权未经书面许可仅属于平台的权利人;
        (3)对于因不可抗力造成的服务中断、链接受阻或其他缺陷(包括但不限于自然灾害、社会事件以及因网站所具有的特殊性质而产生的包括黑客攻击、电信部门技术调整导致的影响、政府管制而造成的暂时性关闭在内的任何影响网络正常运营的因素)，平台不承担任何责任，但将尽力减少因此而给用户造成的损失和影响;
        (4)平台要求使用者必须遵守国家相关的法律法规，平台有权决定删除帐户中关于任何违反中国法律法规的内容，或其他我们认为不可接受的内容。情节严重者，我们有权取消其帐户资格;
        (5)我们尽最大努力保证用户数据的安全与完整，并承诺提供短时间内的数据备份及恢复服务。
        十、最终解释权 我们权利人对筑宬软件网站保有任何活动、限制等的最终解释权 十一、版权声明
        以任何方式使用平台提供的服务，包括但不限于基于平台搭建的数据管理应用等服务，所涉及的版权信息的解释权归平台所有。
        十二、不可抗力及责任免除
        您理解并同意，在使用本服务的过程中，可能会遇到不可抗力等风险因素，使本服务发生中断。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、动乱、政府行为等。出现上述情况时，平台将努力在第一时间与相关单位配合，及时进行修复，但是由此给您造成的损失，平台在法律允许的范围内免责。
        在法律允许的范围内，平台对以下情形导致的服务中断或受阻不承担责任
        (1)用户须明白，本服务涉及到互联网及移动通讯等服务，鉴于计算机及互联网的特殊性，因黑客、病毒、Interet上通路的阻塞电信部门技术或政策调整或筑宬软件网站为进行服务器配置、维护等造成的服务中断、不能满足用户要求等风险。开通服务的用户须承担以上风险，筑宬软件网站权利人对服务及其内容的有效性、正确性、质量、稳定性、可靠性、及时性、适用性、真实性、实用性、准确性或完整性等均不作任何陈述、承诺或保证;
        (2)如平台发生故障影响到本服务的正常运行，平台承诺本第一时间内及时外理进行修复。但用户因此而产生的经济损失，平台不承担责任。此外，平台保留不经事先通知为维修保养、升级或其它目的暂停本服务的权利;
        (3) 对于因甲方员工误操作导致的数据丢失、数据外泄等行为与筑宬软件无关;
        (4)平台对帐户使用平台上公布的信息而造成的损失或伤害以及帐户相信平台上公布的信息内容而做出的决定或采取的行动不负责任;
        (5)平台网站、员工、所有者对帐户使用或无法使用平台的服务而造成的直接的、间接的、偶尔的、特殊的或其他损害不负法律责任，即便事先被告知损害存在的可能性也是如此。
        (6)用户通过非平台授权的方式使用平台功能;
        您理解并同意，本服务并非为某些特定目的而设计，包括但不限于核设施、军事用途、医疗设施、交通通讯等重要领域。如果因为软件或服务的原因导致上述操作失败而带来的人员伤亡、财产损失和环境破坏等，平台不承担法律责任。
        十三、法律适用
        (1)平台与帐户中任何一方未履行协议所规定的责任均视为违约，按《合同法》及其相关司法解释规定处理;如双方在此协议范围内发生纠纷，应尽量友好协商解决。此协议适用中华人民共和国法律(不包括冲突法》。
        (2)如协商不成的，您同意将纠纷或争议提交乙方所在地有管辖权的人民法院管辖。如与此协议有关的某一特定事项缺乏明确法律规定，则应参照通用的国际商业惯例和行业惯例。本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。
        十五、如果您对本协议或本服务有意见或建议，欢迎您与筑宬软件联系，联系方式为：邮箱。
      </div>
    </main>
  )
}

export default TermOfService
